<template>
<div id="index">
    <Title></Title>
    <Index1></Index1>
    <div class="chapter">
        <div class="pointer to_left">
            <router-link to="/israel2">&lt;</router-link>
        </div>
        <div class="pointer to_right">
            <router-link to="/pal2">&gt;</router-link>
        </div>
        <div class="text_box">
            <h1>国連分割案</h1>
            <p>なおも増加するユダヤ人と先住していたアラブ人の間では年を追うごとに暴力が加速しており毎年多くの犠牲者を出していた。
            <br>そのような中、この地を独立させるべく、国際連合はパレスチナを分割することとなった。分割案ではユダヤ人国家（イスラエル）とアラブ人国家（パレスチナ）をそれぞれ独立させ、ユダヤ教だけでなくイスラム教、キリスト教の聖地にもなっているエルサレムは国際管理地としておくという案だった。
            <br>ユダヤ人側はこの案を受け入れ、独立の準備を進める中、アラブ人側はこの案を断固拒否し、長年積もっていた不満はついに爆発することとなった。
            </p>
        </div>
        <div class="map_wrap">
            <svg id="partition_map" viewBox="0 0 322.8627 975.8237"><path class="israel" d="M282.3655,217.2145l-29.3763-29.3762H233.1428V155.8822H260.726V123.0853H246.43l12.2779-12.2779V96.4553h10.8015v-23.92h12.9676V53.8478H271.3707l-7.4041,7.404H252.1874l-9.76-9.76h-47.79l-1.37,40.4607h11.5077V111.48l6.0548,6.0548-8.41,8.41s23.9951,23.3223,23.9951,23.995v15.5857l-41.7671,41.7669v11.4931l-9.5588,9.5588v38.207l-13.5252,13.5252v48.3685L141.29,348.7186v16.84h20.141v7.1761L151.1471,383.019H134.1352L123.8039,393.35h-9.6272L99.4949,378.6684l-.3251.9589-46.3877,73.592v6.5627L0,512.5641l68.9446,172.65V716.689l5.3206,5.3208v18.1735L100.61,712.9261V698.7982h20.1827V670.8787h18.9494v-10.54l-23.7708-23.7707h-24.78L66.9715,573.6651H53.5163L29.4092,531.2813V514.4625H40.1733V491.5887l27.8074-27.8074h9.5047V449.0666L90.13,436.4224V423.2437l25.8412-25.8412,6.1669,11.4369-15.4734,15.4734v28.2559l26.5739,26.5739v48.3265H239.0856V490.6917l21.304-21.304H277.709V457.9871l6.5627-6.5627V422.93l8.75-8.75v-48.463l-5.7915-5.7916,4.9781-4.9781V295.35l7.2639-7.2639V236.6133h-17.107ZM246.0374,403.532h-8.6711v12.4087H227.35l-6.6529,6.6529h-6.5033v-20.108L210.0074,398.3l-1.196-10.3156h7.4751l6.8024-6.8023h22.9485Z"/><path class="palestine" d="M123.8039,393.35l10.3313-10.3313h17.0119l10.2842-10.2843v-7.1761H141.29v-16.84l20.2739-20.2739V280.0762l13.5252-13.5252V228.344l9.5588-9.5588V207.2921l41.7671-41.7669V149.94c0-.6727-23.9951-23.995-23.9951-23.995l8.41-8.41-6.0548-6.0548V91.9526H193.2672l-.7612,22.474L182.41,124.5231l-5.16-5.16H163.7872l-20.193,129.2348L99.4949,378.6684,114.1767,393.35Z"/><polygon class="palestine" points="239.086 490.692 239.086 527.469 133.238 527.469 133.238 479.143 106.664 452.569 106.664 424.313 122.138 408.839 115.971 397.403 90.13 423.244 90.13 436.422 77.485 449.067 77.485 463.781 67.981 463.781 40.173 491.589 40.173 514.462 29.409 514.462 29.409 531.281 53.516 573.665 66.972 573.665 91.191 636.568 115.971 636.568 139.742 660.339 139.742 670.879 120.792 670.879 120.792 698.798 100.609 698.798 100.609 712.926 74.265 740.183 87.503 753.421 146.174 939.308 151.391 975.824 161.319 965.896 168.639 965.896 168.639 946.965 175.622 939.981 175.622 914.908 184.204 906.326 184.204 892.191 189.589 886.806 189.589 858.536 198.508 849.618 195.058 846.168 208.604 832.622 208.604 814.617 204.397 810.41 204.397 775.072 216.513 762.957 216.513 746.802 207.451 737.74 216.563 728.629 216.563 696.706 233.44 679.829 233.44 658.725 246.664 645.501 246.664 623.15 255.553 614.261 259.315 614.261 264.086 609.49 264.086 583.359 273.628 573.816 273.628 548.337 259.395 534.103 259.395 515.397 277.709 497.083 277.709 469.388 260.39 469.388 239.086 490.692"/><polygon class="international" points="216.287 387.984 208.811 387.984 210.007 398.299 214.193 402.486 214.193 422.594 220.697 422.594 227.35 415.941 237.366 415.941 237.366 403.532 246.037 403.532 246.037 381.182 223.089 381.182 216.287 387.984"/><polygon class="palestine" points="294.088 202.098 299.304 196.881 299.304 175.005 313.944 160.366 305.026 151.447 314.112 142.36 314.112 81.781 306.203 73.872 318.824 61.252 318.824 42.405 322.863 38.367 322.863 10.77 312.093 10.77 301.324 0 292.573 0 292.573 35.674 282.477 45.771 282.477 53.848 282.477 72.535 269.509 72.535 269.509 96.455 258.708 96.455 258.708 110.807 246.43 123.085 260.726 123.085 260.726 155.882 233.143 155.882 233.143 187.838 252.989 187.838 282.365 217.215 282.365 236.613 299.472 236.613 299.472 207.482 294.088 202.098"/>
            </svg>
            <svg id="part_map_legend" viewBox="0 40 275 207">
                <circle class="israel" cx="27.9321" cy="74.6554" r="27.4321"/><circle class="international" cx="27.9321" cy="201.2474" r="27.4321"/><circle class="palestine" cx="27.9321" cy="137.9514" r="27.4321"/><text class="leg_text" transform="translate(74.2394 88.9816)">ユダヤ人国家</text>><text class="leg_text" transform="translate(74.2394 218.5285)">国際管理地</text><text class="leg_text" transform="translate(74.2394 154.0402)">アラブ人国家</text>
            </svg>
        </div>
    </div>
    <div class="chapter">
    <Index3></Index3>
    </div>
</div>
</template>

<style scoped>

.chapter{
    /* width: 500px; */
    position: relative;
    height: 100vh;
    justify-content: center;
    align-content: center;
    text-align: center;
    display: block;
    margin-bottom: 100px;
}
.pointer{
    position: absolute;
    top: 45vh;
    width: 10%;
    z-index: 10;
}
.pointer.to_right{
    right: 3vw;
}
.pointer.to_left{
    left: 3vw;
}
.pointer a{
    text-decoration: none;
    font-size: 500%;
    height: 100%;
}
.pointer.to_left a{
    color: #0071ba;
}
.pointer.to_right a{
    color: #0e8136;
}
.text_box{
    position: absolute;
    top: 10vh;
    left: 20vw;
    width: 30%;
    height: 80vh;
}
.text_box h1{
    font-size: 80px;
    border-bottom: 3px solid #e1e1e1;
    margin-bottom: 25px;
}
#palestine_map{
    justify-content: center;
    margin: auto;
    width: 50%;
    height: 50%;
    padding: 100px;
}
.cls-1{
    fill:none;
    stroke:#0071ba;
    stroke-miterlimit:10;
    stroke-width:3px;
}
.map_wrap{
    width: 50%;
    float: right;
}
#partition_map{
    height: 700px;
}
.israel, .palestine, .international{
    stroke: #fff;
    stroke-width: 2px;
    stroke-miterlimit: 10;
}
.israel{
    fill: #0071ba;
}
.palestine{
    fill: #0e8136;
}
.international{
    fill: #ccc;
}
#part_map_legend{
    fill: #e1e1e1;
    margin-left: 20px;
    height: 200px;
    font-size:29.8097px;
    font-family:VDL-V7Gothic-Bold-90ms-RKSJ-H, VDL-V7Gothic;
}
</style>
<script>
import Title from './title.vue'
import Index1 from './index1.vue'
import Index3 from './index3.vue'

export default{
    components:{
        Title,
        Index1,
        Index3
    }
}
</script>