<template>
<div id="fix2">
    <div class="box">
        <div class="map_box">
            <svg id="arab_pen" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 694.1255 749.9819" >
                <path class="arab_coun" d="M71.85,22.2814l8.9649,8.9649H93.7152L104.1013,20.86H124.327l6.3137,6.3137h18.6131l5.562-5.5621h15.4289l10.3794-10.3793h53.0308l7.8136-7.8135h9.6789l5.2768,5.2768h23.1485v8.6369l9.5516-9.5517,8.7463,8.7462V31.2463L308.2913,41.667v8.6023h7.1409l6.997,6.997h12.2447l-6.56,6.56V80.4438h-4.81v8.309l-13.338,13.338,6.341,6.341-8.5275,8.5276,24.4894,24.4894-5.4664,5.4664,8.5276,8.5276h8.9649L354.9,166.0476h9.5115v5.7944l15.5246,15.5245v4.5918l-7.7623,7.7623v14.9779h9.73V229.13l18.5857,18.5857h-8.9649l-15.8525,15.8526L393.2737,281.17v20.9909l47.23,47.23v29.1541l12.9736,12.9736V404.2l4.446-4.446V384.3754l6.0131-6.013V370.6l4.1362-4.1362,6.3228,6.3228H478.55v33.2357L476.8,407.7716v7.8716l-1.8586,1.8586,3.3892,3.3892h7.2156v8.9649H501.29l7.1063-7.1064h16.7272l4.3184,4.3185h13.3927l46.4917-46.4917H594L610.6859,363.89v42.7882l17.677,17.677v5.5006h7.6188l6.341,6.341h5.0291l3.8264,3.8265h20.2257l10.4408,10.4408v7.38l12.9281,12.928H704.64v11.9988L691.52,495.89v8.7463l-16.1805,16.18v6.1223l-13.5566,13.5567V528.251L650.85,539.1838v10.0581h-6.1224v14.4313l4.3731,4.3731v8.7463H626.7981L611.93,591.6612v12.2447l-3.4985,3.4985H586.1281l-6.341,6.341v11.1515l-9.2929,9.2928H543.7089l-7.161,7.161h-18.64l-7.7349,7.735h-11.07v24.79h-13.994l-10.2768,10.2768h-21.21l-11.2608,11.2608H426.5094l-4.5371,4.5371h-8.145L396.69,717.0876H379.717L367.2126,729.592h-11.985L349.85,734.97H319.368l-10.779,10.779h-4.9642l-7.5761,7.5761H283.0711l-4.444,4.444h-8.238l-6.0869-6.0869h-8.7817V719.3562l-9.4022-9.4022V697.0533l-6.2317-6.2317V638.0162l-33.509-33.509v-15.47l-18.0664-18.0664V557.1136l-19.966-19.9661h-7.7213l-22.1594-22.1594V471.4005l-9.9113-9.9113V441.226L108.51,421.1831H95.4644V411.0515L88.03,403.6172V391.3724L72.9429,376.2852v-7.653L62.1194,357.8088V347.204L40.9645,326.049V313.9683l-6.86-6.86H14.9991l7.5026-7.5026V261.2722l-16.03-58.3811,12.5727-12.5727v-11.771L24.0915,173.5v-7.1974l2.0864-2.0864v-8.9922h4.4186V143.2709l6.7055-6.7054V129.277s8.6-6.7055,8.6-8.6V107.4114l8.2361-8.2361V46.4793L48.9272,41.268,60.771,29.4241l-6.2316-6.2317Z" transform="translate(-6.4715 -3.4189)"/>
            <g @mousemove="mouseOverEffect" @mouseout="mouseOffEffect">
                <polygon class="inde" id="SAU" points="246.228 637.59 246.228 615.277 250.093 611.412 259.354 620.673 318.711 620.673 340.878 620.673 349.647 629.442 354.296 629.442 373.775 609.963 373.775 603.61 396.85 580.535 484.094 571.816 565.619 543.961 582.901 485.77 572.182 463.311 568.973 466.228 499.262 456.894 472.646 418.173 469.255 414.782 471.114 412.923 471.114 405.047 459.082 412.777 447.78 401.474 447.78 388.786 434.8 375.806 434.8 346.638 387.547 299.386 387.547 287.573 366.984 289.323 360.859 273.572 335.92 270.509 284.73 267.009 213.414 206.631 169.662 179.942 136.118 171.629 131.042 178.338 75.157 194.381 101.991 225.882 94.408 230.841 89.157 242.508 67.573 247.175 51.531 267.009 20.321 259.134 16.597 258.477 16.597 278.822 16.597 296.829 9.091 304.335 28.205 304.335 35.069 311.199 35.069 323.285 56.234 344.451 56.234 355.06 67.063 365.889 67.063 373.546 82.157 388.64 82.157 400.891 89.595 408.329 89.595 418.465 102.647 418.465 122.7 438.518 122.7 458.791 132.616 468.707 132.616 512.316 154.786 534.486 162.511 534.486 182.486 554.461 182.486 568.325 200.562 586.4 200.562 601.878 234.087 635.403 234.087 645.028 238.79 645.028 246.228 637.59"/>
                <path class="bri" id="LEB" d="M44.1492,141.1854l11.23-11.23-2.7711-2.7709,4.8128-4.8127h6.8544L60.41,118.5071l11.011-11.0109v-5.6878l-7.6566-7.6567H53.9935V99.11l-8.24,8.24v13.2715c0,1.8959-8.6046,8.6046-8.6046,8.6046v7.2921L30.44,143.2271v2.7711h8.8963Z" transform="translate(-5.7443 -2.8078)"/>
                <polygon class="bri" id="SYR" points="65.677 99.001 65.677 104.688 54.666 115.699 58.531 119.564 51.676 119.564 46.864 124.377 49.635 127.148 38.405 138.378 38.405 157.045 41.613 153.837 49.489 161.712 72.24 169.004 125.966 135.953 125.966 135.953 125.966 135.953 183.662 100.459 190.079 89.667 191.837 77.124 191.837 34.546 197.955 28.428 204.678 28.428 224.789 8.317 174.796 8.317 164.411 18.702 148.975 18.702 143.41 24.266 124.788 24.266 118.471 17.95 98.236 17.95 87.845 28.341 74.938 28.341 65.969 19.372 48.65 20.283 54.885 26.518 43.035 38.367 48.249 43.581 48.249 49.123 48.249 68.374 48.249 91.344 58.02 91.344 65.677 99.001"/>
                <polygon class="fre" id="QTA" points="471.114 405.047 472.864 403.297 472.864 370.046 468.708 370.046 462.382 363.72 458.244 367.858 458.244 375.624 452.228 381.64 452.228 397.026 447.78 401.474 459.082 412.777 471.114 405.047"/>
                <polygon class="fre" id="UAE" points="568.973 466.228 572.182 463.311 572.182 452.227 581.808 437.643 578.891 426.267 592.6 423.642 592.6 419.267 585.308 418.173 587.349 397.682 596.1 402.933 605.065 395.932 605.065 376.677 597.298 368.911 588.37 377.839 583.694 377.839 537.18 424.353 523.781 424.353 519.46 420.033 502.725 420.033 495.616 427.142 479.865 427.142 479.865 418.173 472.646 418.173 499.262 456.894 568.973 466.228"/>
                <polygon class="fre" id="KUW" points="367.422 238.57 352.983 240.32 335.92 270.509 360.859 273.572 366.984 289.323 387.547 287.573 387.547 278.385 369.937 260.774 385.798 244.914 380.985 240.758 367.422 238.57"/>
                <polygon class="fre" id="PAL" points="34.905 195.255 36.071 165.796 38.405 157.045 38.405 138.378 33.592 143.19 24.696 143.19 24.696 152.378 20.275 152.378 20.275 161.375 18.188 163.462 18.188 170.663 13.138 175.713 13.138 187.49 0.559 200.068 16.597 258.477 20.321 259.134 34.905 195.255"/>
                <polygon class="inde" id="OMA" points="689.192 468.078 676.257 455.144 676.257 447.76 665.812 437.315 645.576 437.315 641.748 433.486 636.716 433.486 630.372 427.142 622.75 427.142 622.75 421.639 605.065 403.954 605.065 395.932 596.1 402.933 587.349 397.682 585.308 418.173 592.6 419.267 592.6 423.642 578.891 426.267 581.808 437.643 572.182 452.227 572.182 463.311 582.901 485.77 565.619 543.961 484.094 571.816 514.721 638.739 530.891 638.739 538.055 631.575 564.853 631.575 574.151 622.277 574.151 611.12 580.495 604.776 602.808 604.776 606.309 601.276 606.309 589.025 621.184 574.15 643.498 574.15 643.498 565.399 639.123 561.024 639.123 546.586 645.248 546.586 645.248 536.523 656.186 525.585 656.186 537.835 669.749 524.272 669.749 518.147 685.938 501.959 685.938 493.208 699.063 480.082 699.063 468.078 689.192 468.078"/>
                <polygon class="fre" id="IRQ" points="169.662 179.942 213.414 206.631 284.73 267.009 335.92 270.509 352.983 240.32 367.422 238.57 380.985 240.758 385.798 244.914 394.767 244.914 376.172 226.32 376.172 211.881 366.437 211.881 366.437 196.896 374.203 189.13 374.203 184.536 358.671 169.004 358.671 163.207 349.155 163.207 338.545 152.597 329.576 152.597 321.044 144.065 326.513 138.596 302.012 114.095 310.544 105.563 304.2 99.219 317.544 85.875 317.544 77.562 322.357 77.562 322.357 60.936 328.92 54.373 316.669 54.373 309.669 47.373 302.524 47.373 302.524 38.767 292.098 28.341 292.098 13.615 283.348 4.864 273.792 14.42 273.792 5.779 250.632 5.779 245.353 0.5 235.669 0.5 227.852 8.317 224.789 8.317 204.678 28.428 197.955 28.428 191.837 34.546 191.837 77.124 190.079 89.667 183.662 100.459 125.966 135.953 136.118 171.629 169.662 179.942"/>
                <polygon class="inde" id="YEM" points="303.399 696.333 349.726 629.446 340.957 620.678 318.79 620.678 259.433 620.678 250.172 611.417 246.307 615.281 246.307 637.595 238.869 645.033 234.166 645.033 234.166 688.238 240.4 694.473 240.4 707.38 249.807 716.787 249.807 749.128 258.593 749.128 303.399 708 303.399 696.333"/>
                <polygon class="fre" id="YMD" points="484.173 571.821 396.929 580.54 373.854 603.614 373.854 609.967 354.375 629.446 349.726 629.446 303.399 696.333 303.399 708 258.593 749.128 264.683 755.218 272.925 755.218 277.371 750.772 290.355 750.772 297.935 743.192 302.901 743.192 313.685 732.408 344.182 732.408 349.562 727.027 361.553 727.027 374.064 714.517 391.045 714.517 408.19 697.372 416.339 697.372 420.878 692.832 436.738 692.832 448.005 681.566 469.224 681.566 479.506 671.284 493.507 671.284 493.507 646.482 504.582 646.482 512.32 638.744 514.8 638.744 484.173 571.821"/>
                <polygon class="fre" id="JOR" points="34.905 195.255 20.321 259.134 51.531 267.009 67.573 247.175 89.157 242.508 94.408 230.841 101.991 225.882 75.157 194.381 131.042 178.338 136.118 171.629 125.966 135.953 72.24 169.004 49.489 161.712 41.613 153.837 38.405 157.045 36.071 165.796 34.905 195.255"/>           
            </g>
            </svg>
            <div id="icon"><p></p></div>
        </div>
        
        <div class="legend_box">
            <div class="legend arab_coun">
            <svg id="independent" viewBox="0 0 58.2 58.2">
                <rect width="58.1353" height="58.1353"/>
            </svg>
            独立国家
            </div>
            <div class="legend bri">
            <svg id="independent" viewBox="0 0 58.2 58.2">
                <rect width="58.1353" height="58.1353"/>
            </svg>
            フランス領
            </div>
            <div class="legend fre">
            <svg id="independent" viewBox="0 0 58.2 58.2">
                <rect width="58.1353" height="58.1353"/>
            </svg>
            イギリス領
            </div>
        </div>
        <transition name="text_animation">
        <div class="text_box" key="1" v-if="text_flag">
            <h1>統一国家の約束</h1>
            <p>第一次世界大戦前、アラビア半島はオスマン帝国の支配下にあった。しかしアラビア半島に居住していたアラブ人は自らの国家を求め第一次世界大戦前から各地で運動を展開していた。第一次世界大戦が勃発すると、オスマン帝国と対立していたイギリスがここに目を付け、アラブ人ととある約束を交わす。「オスマン帝国との戦闘に協力した暁には、アラビア半島にアラブ人国家の樹立を支援する。」
            <br>こうしてアラブ人は悲願の統一国家のためオスマン帝国に反乱した。
            </p>
        </div>
        <div class="text_box" key="2" v-else>
            <h1>サイクスピコ協定</h1>
            <p>しかし、第一次世界大戦が終結すると、約束されていたアラブ人の統一国家はどこにもなかった。代わりにあったのはイギリスやフランスの支配下の植民地であった。
            <br>実は大戦中、イギリスとフランスは自らアラビア半島を分割することを水面下で決定していたのだった。これが有名なサイクスピコ協定である。裏切られたアラブ人はイギリスやフランスに多大な不信感を抱くとともに、イギリスの支配下となったパレスチナにやってくる膨大なユダヤ人に対して、大きな懸念を抱いていた。
            </p>
        </div>
        </transition>
        <button @click="show_map">サイクスピコ協定</button>
        
        
        <div id="logging"></div>
    </div>
</div>
</template>
<style scoped>
    #fix2{
        height: 100vh;
        display: block;
        /* margin-bottom: 200px; */
    }
    .box{
        position: relative;
    }
    .arab_coun{
        fill: #0e8316;
        visibility: visbile;
        transition: opacity .5s ease-in-out, visibility .5s ease-in-out;
    }
    .inde{
        fill:#0e8316;
    }
    .bri{
        fill:blue;
    }
    .fre{
        fill: red;
    }
    .inde, .bri, .fre{
        stroke: #fff;
        stroke-width: 2px;
        stroke-dasharray: 3000;
        stroke-dashoffset: 3000;
        opacity: 0;
        visibility: hidden;
        transition: opacity .5s ease-in-out, stroke-dashoffset .5s ease-in-out, visibility .5s ease-in-out;
    }
    .show{
        opacity: 1;
        stroke-dashoffset: 0;
        visibility: visible;
    }
    .hide{
        opacity: 0;
        visibility: hidden;
    }
    .map_box{
        height: 80vh;
        position: absolute;
        top: 3vh;
        left: 55vw;
    }
    #arab_pen{
        height: 100%;
    }
    .text_box{
        position: absolute;
        top: 10vh;
        left: 10vw;
        width: 35%;
    }
    .text_box h1{
        font-size: 80px;
        border-bottom: 3px solid #0e8316;
        margin-bottom: 25px;
    }
    .text_box p{
        width: 80%;
        margin: auto;
    }
    .legend_box{
        position: absolute;
        top: 65vh;
        left: 43vw;
        width: 20%;
        margin: auto;
        font-size: 42px;
        text-align: left;
    }
    #independent{
        height: 30px;
    }
    .flag{
        stroke: yellow;
        stroke-width: 5px;
    }
    #icon{
        position: absolute;
        height: 50px;
        width: 250px;
        background-color: #eee;
        border: 3px solid #333;
        border-radius: 5px;
        transform: translate(0%,-110%);
        display: none;
        font-size: 25px;
        vertical-align: center;
        color: #333;
    }
    #icon p{
        margin-top: 5px;
    }
    button{
        width: 250px;
        height: 70px;
        padding: 15px;
        border-radius: 10px;
        cursor: pointer;
        font-size: 25px;
        transition: all .2s ease-in-out;
        position: absolute;
        top: 65vh;
        left: 20.5vw;
    }
    button:hover{
        background-color: #3a3a3a;
        color: #e1e1e1;
    }
    .text_animation-leave-active{
        transition: all 0s;
    }
    .text_animation-enter-active{
        transition: all .7s ease-in-out;
    }
    .text_animation-enter, .text_animation-leave-to{
        opacity: 0;
    }
    .text_animation-enter{
        transform: translateY(50px);
    }
</style>
<script>
export default{
    data(){
        return{
            flag: false,
            text_flag: true,
            countries: [
                {id: 'SAU', name: 'サウジアラビア'},
                {id: 'LEB', name: 'レバノン委任統治領'}, 
                {id: 'SYR', name: 'シリア委任統治領'},
                {id: 'QTA', name: '休戦オマーン'},
                {id: 'UAE', name: '休戦オマーン'},
                {id: 'KUW', name: 'クウェート保護領'},
                {id: 'PAL', name: 'パレスチナ委任統治領'},
                {id: 'OMA', name: 'オマーン'},
                {id: 'IRQ', name: 'イラク委任統治領'},
                {id: 'YEM', name: 'イエメン'},
                {id: 'YMD', name: 'アデン保護領'},
                {id: 'JOR', name: 'ヨルダン'},
            ],
        }
    },
    methods: {
        show_map(){
            var cls = document.querySelectorAll(".inde, .bri, .fre");
            this.flag = !this.flag;
            var old = document.querySelectorAll("#arab_pen .arab_coun");

            if(this.flag){
                cls.forEach(element =>{
                    element.classList.add("show");
                    old[0].classList.add("hide");
                })
            } else {
                cls.forEach(element =>{
                    element.classList.remove("show");
                    old[0].classList.remove("hide");
                })
            }
            this.text_flag = !this.text_flag;
        },
        mouseOverEffect(event){        
            var icon = document.getElementById("icon");
            // console.log(icon.children);
            icon.style.display = "block"
            var width = event.offsetX - icon.style.width/2;
            var target = event.target.id;
            icon.style.left = width+'px';
            icon.style.top = event.offsetY+'px';
            // icon.innerHTML = target;
            var tmp = this.countries.filter(element => {
                    return element.id == target;
                });
            if(tmp.length > 0){
                icon.children[0].innerHTML = tmp[0].name;
            }
        },
        mouseOffEffect(event){
            var icon = document.getElementById("icon");
            icon.style.display = "none";
        }
    },
}
</script>